package Глава11_Многопоточное_программирование;

public class Ch11INFO {
    /*

==========================================================================|
|  getName      | Получает имя потока исполнения                          |
|---------------|---------------------------------------------------------|
|  getPriority  | Получает приоритет потока исполнения                    |
|---------------|---------------------------------------------------------|
|  isAlive      | Определяет, выполняется ли поток                        |
|---------------|---------------------------------------------------------|
|  join         | Ожидает завершения потока исполнения                    |
|---------------|---------------------------------------------------------|
|  run          | Задает точку входа в поток исполнения                   |
|---------------|---------------------------------------------------------|
|  sleep        | Приостанавливает выполнение потока на заданное время    |
|---------------|---------------------------------------------------------|
|  run          | Запускает поток, вызвая его метод run()                 |
==========================================================================|

 */
}
